package com.telegramBot.utils;

public class Constants{
    public final static String USD = "USD";
    public final static String GBP = "GBP";
    public final static String UAH = "UAH";
    public final static String EUR = "EUR";
    public final static String CNY = "CNY";
    public final static String HELP_TEXT = "Вас приветствует бот-агрегатор новостей в сфере финансов.\n\n" +
            "Что я умею:\n\n" +
            "•Предоставлять актуальные новости из различных источников, включая:\n" +
            "    - Ведущие деловые издания: РБК, РИА\n\n" +
            "•Обеспечивать поиск новостей по тегам(`/news`):\n" +
            "    - Перейдите в меню `Популярные тэги` , чтобы вам выдали список топ-12 популярных тэгов\n" +
            "    - Перейдите в меню `Поиск по тэгу`, и впишите название тэга, если такой тэг существует бот вернет вам новость с этим тэгом\n\n" +
            "• Предоставлять информацию о курсах валют(`/currency`):\n" +
            "    - Перейдите в меню `Популярные валюты` , чтобы вам выдали список топ-5 популярных валют\n" +
            "    - Перейдите в меню `Все валюты` , чтобы вам выдали список всех доступных валют\n";
}
